
set var_file_to_open18 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/DECODER/cossin_gen.sv"
set var_file_to_open17 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/DECODER/iq_demod.sv"
set var_file_to_open16 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/DECODER/fir_filter.sv"
set var_file_to_open15 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/DECODER/decoder_top.sv"

set var_file_to_open14 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/CORDIC/cordic_block.sv"
set var_file_to_open13 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/CORDIC/rotation.sv"
set var_file_to_open12 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/CORDIC/system.sv"

set var_file_to_open11 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/CDR/ffd.sv"
set var_file_to_open10 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/CDR/counter.sv"
set var_file_to_open9 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/CDR/counter_decision.sv"
set var_file_to_open8 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/CDR/phase_detector.sv"
set var_file_to_open7 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/CDR/divN.sv"
set var_file_to_open6 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/CDR/decision.sv"
set var_file_to_open5 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/CDR/cdr.sv"

set var_file_to_open4 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/EI/DFF.sv"
set var_file_to_open3 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/EI/OS.sv"
set var_file_to_open2 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/EI/outFIFO.debug.sv"

set var_file_to_open1 "/tp/xph2app/xph2app103/zigbee_project_2/rtl/wrapper/decoder_cordic_cdr_ei.sv"



analyze -library WORK -format sverilog $var_file_to_open18
analyze -library WORK -format sverilog $var_file_to_open17
analyze -library WORK -format sverilog $var_file_to_open16
analyze -library WORK -format sverilog $var_file_to_open15
analyze -library WORK -format sverilog $var_file_to_open14
analyze -library WORK -format sverilog $var_file_to_open13
analyze -library WORK -format sverilog $var_file_to_open12
analyze -library WORK -format sverilog $var_file_to_open11
analyze -library WORK -format sverilog $var_file_to_open10
analyze -library WORK -format sverilog $var_file_to_open9
analyze -library WORK -format sverilog $var_file_to_open8
analyze -library WORK -format sverilog $var_file_to_open7
analyze -library WORK -format sverilog $var_file_to_open6
analyze -library WORK -format sverilog $var_file_to_open5
analyze -library WORK -format sverilog $var_file_to_open4
analyze -library WORK -format sverilog $var_file_to_open3
analyze -library WORK -format sverilog $var_file_to_open2
analyze -library WORK -format sverilog $var_file_to_open1



elaborate decoder_cordic_cdr_ei -architecture verilog -library WORK

create_clock -name "i_clk" -period 20 -waveform { 0 10  }  { i_clk  }
set_operating_conditions -library c35_CORELIB_TYP TYPICAL

###compile -exact_map -ungroup_all -auto_ungroup area

set name_netlist "zigbee_RX_netlist.v"
set name_sdc "zigbee_RX.sdc"

write -hierarchy -format verilog -output /tp/xph2app/xph2app103/zigbee_project_2/simu/post_synth/zigbee_RX/$name_netlist
write_sdc $name_sdc

uplevel #0 { report_area }
uplevel #0 { report_clock -attribute }


