set var_path "/tp/xph2app/xph2app007/Documents/PROJET_ZIGBEE_2A_MT_2022/zigbee_project_2/rtl"

analyze -library WORK -format sverilog $var_path/MUX/MUX_411.sv
analyze -library WORK -format sverilog $var_path/MUX/MUX_414.sv


elaborate MUX414 -architecture verilog -library WORK

create_clock -name "inClock" -period 20 -waveform { 0 10  }  { inClock  }
set_operating_conditions -library c35_CORELIB_TYP TYPICAL

compile -exact_map -ungroup_all -auto_ungroup area


set name_netlist "MUX414_netlist.v"
set name_sdc "MUX414_1.sdc"

write -hierarchy -format verilog -output $var_path/../simu/post_synth/MUX/$name_netlist
write_sdc $var_path/../simu/post_synth/MUX/$name_sdc


uplevel #0 { report_area }
uplevel #0 { report_clock -attribute }
